{
  "id": "intrincantation/cf-userdata",
  "title": "Codeforces User Practice and Rating History",
  "subtitle": "Investigate how people improve their programming skills over time",
  "description": "Rating for about 61k different rated users of codeforces. Using the [API](https://codeforces.com/apiHelp), I scraped all active users in dec 2022 and january 2023 (it took about a month to run the script). Thanks to the CF team for open with their data so that we can do interesting analysis!\n\nFor each user, you can view the last 10,000 submissions they have made to codeforces (usually, this is all of them) as well as the full history of contests they have participated in and their rating changes. Also, there is information about all the tags/difficulty for most of the problems.\n\nBy combining these timestamps, you can do some analysis on the best strategy to improve in competitions, what problems/tags are the most valuable to learn from, etc.\n\nSources of uncertainly: People don't always practice on codeforces. They can come in with varying level of experience, and they often do things on different sites at the same time as they practice on codeforces. Furthermore, there is no way to know how much time is spent thinking on problems or reading editorials.",
  "isPrivate": true,
  "keywords": [
    "computer science",
    "programming"
  ],
  "licenses": [
    {
      "name": "CC0-1.0"
    }
  ],
  "collaborators": [],
  "resources": [
    {
      "path": "contests_sample.csv",
      "description": "An example of the submission history, taken from user https://codeforces.com/profile/WolfBlue\nObtained from https://codeforces.com/apiHelp/objects#Submission",
      "schema": {
        "fields": [
          {
            "name": "updateTime",
            "title": "Time that the rating was updated in seconds.",
            "type": "integer"
          },
          {
            "name": "oldRating",
            "title": "Rating before the contest",
            "type": "integer"
          },
          {
            "name": "newRating",
            "title": "Rating after the contest. Tip: you can estimate the performance rating as (newRating - oldRating) * 4 + oldRating",
            "type": "integer"
          },
          {
            "name": "rank",
            "title": "Rank within the contest",
            "type": "integer"
          }
        ]
      }
    },
    {
      "path": "problems.csv",
      "description": "List of regular problems on codeforces. It does not include problems from gym or private problems.",
      "schema": {
        "fields": [
          {
            "name": "problemId",
            "title": "id for this problem, in the form contestid:problemnumber",
            "type": "string"
          },
          {
            "name": "tags",
            "title": "Tags for this problem, they are choosen by high rated users that solved it.",
            "type": "string"
          },
          {
            "name": "name",
            "title": "Name of the problem",
            "type": "string"
          },
            {
            "name": "rating",
            "title": "difficulty of the problem",
            "type": "number"
          },
          {
            "name": "solved",
            "title": "Number of correct solutions for this problem",
            "type": "integer"
          }
        ]
      }
    },
    {
      "path": "submissions_sample.csv",
      "description": "An example of the submission history, taken from user https://codeforces.com/profile/WolfBlue\nObtained from https://codeforces.com/apiHelp/objects#Submission",
      "schema": {
        "fields": [
          {
            "name": "problemName",
            "title": "Name of the problem",
            "type": "string"
          },
          {
            "name": "problemId",
            "title": "Id of the problem, in the format contest:problem. Note that not all ids are in problems.csv, if the contest number is more than 2k it's a gym or private contest.",
            "type": "string"
          },
          {
            "name": "creationTime",
            "title": "Time that the submission was created in seconds",
            "type": "integer"
          },
          {
            "name": "relativeTimeSeconds",
            "title": "Time into the contest before submission, or a large constant for practice.",
            "type": "integer"
          },
          {
            "name": "participantType",
            "title": "virtual contests simulate contest experience, but are not live.",
            "type": "string"
          },
          {
            "name": "verdict",
            "title": "OK means the code passed, otherwise the reason for failure.",
            "type": "string"
          },
          {
            "name": "testset",
            "title": "PRETESTS are in contests, submissions that pass will be run against the full test set at the end of contest, you must pass the full test to get credit.",
            "type": "string"
          },
          {
            "name": "programmingLanguage",
            "title": "Language of this submission",
            "type": "string"
          },
          {
            "name": "passedTestCount",
            "title": "Number of test cases that this submission passed. Submissions are run until the first failed case.",
            "type": "integer"
          },
          {
            "name": "points",
            "title": "Number of points scored on the problem if it supports it.",
            "type": "string"
          }
        ]
      }
    }
  ]
}